tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# CLI Утилиты
brew "ansible"              # Автоматизация конфигураций
brew "argocd"               # GitOps инструмент для Kubernetes
brew "bat"                  # Красивый вывод файлов
brew "btop"                 # Мониторинг ресурсов
brew "dua-cli"             # Проверка размера директорий
brew "eza", name: "exa"     # Улучшенная версия ls (exa переименован в eza)
brew "fd"                   # Быстрая альтернатива find
brew "fzf"                  # Интерактивный поиск
brew "git"                  # Система контроля версий
brew "helm"                 # Пакетный менеджер Kubernetes
brew "jq"                   # JSON-парсер
brew "k9s"                  # TUI-интерфейс для Kubernetes
brew "kubectl", name: "kubernetes-cli"  # Клиент Kubernetes
brew "lsd"                  # Ещё один красивый ls
brew "midnight-commander"  # Двухпанельный файловый менеджер
brew "neovim"               # Современный vim
brew "nmap"                 # Сканер портов
brew "powerlevel10k"        # Тема для zsh
brew "ripgrep"              # Быстрый поиск по тексту
brew "terraform"            # IaC от HashiCorp
brew "terragrunt"           # Обёртка над Terraform
brew "tree-sitter"          # Парсер кода (используется в Neovim)
brew "yazi"                 # Файловый TUI-менеджер
brew "zoxide"               # Умная навигация по директориям
brew "zsh"                  # Улучшенный shell
brew "zsh-syntax-highlighting" # Подсветка синтаксиса в Zsh

# Сетевые инструменты и безопасность
brew "gnupg"
brew "gpgme"
brew "telnet"
brew "mc"
brew "libgcrypt"
brew "libassuan"
brew "openssl@3"
brew "wireshark"
brew "unbound"
brew "zeromq"
brew "libsodium"
brew "libssh"
brew "libssh2"
brew "libnghttp2"
brew "libnghttp3"

# Мультимедиа и графика
brew "ffmpeg"
brew "imagemagick"
brew "tesseract"
brew "ffmpegthumbnailer"
brew "flac"
brew "lame"
brew "opus"
brew "speex"
brew "x264"
brew "x265"
brew "mpg123"
brew "leptonica"
brew "poppler"
brew "svt-av1"

# Шрифты, отрисовка, интерфейсы
brew "freetype"
brew "harfbuzz"
brew "cairo"
brew "pango"
brew "fontconfig"
brew "glib"
brew "graphite2"
brew "libpng"
brew "jpeg-turbo"
brew "giflib"
brew "libtiff"
brew "webp"

# Lua и окружение
brew "lua"
brew "luajit"
brew "luv"
brew "lpeg"

# Поддержка терминала и текстов
brew "ncurses"
brew "readline"
brew "oniguruma"
brew "libyaml"
brew "libunibreak"
brew "libunistring"
brew "utf8proc"

# Компрессия и форматы
brew "xz"
brew "zstd"
brew "brotli"
brew "lzo"
brew "lz4"
brew "pcre2"
brew "libarchive"
brew "libtool"

# Прочее и зависимости
brew "gettext"
brew "certifi"
brew "m4"
brew "pycparser"
brew "cffi"
brew "cjson"
brew "libuv"
brew "libevent"
brew "libidn2"
brew "p11-kit"
brew "libgit2"
brew "sqlite"
brew "libomp"
brew "libvmaf"
brew "rubberband"
brew "s-lang"
brew "sdl2"
brew "shared-mime-info"

# Casks (GUI, Fonts)
cask "colorwell"                          # GUI-утилита выбора цвета
cask "font-symbols-only-nerd-font"       # Иконки для терминала (Nerd Fonts)

# Установка всех пакетов
# brew bundle --file=~/dotfiles/Brewfile

# Установка Homebrew
# /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
